#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере()
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Спр = Справочники.ВКМ_УведомленияТелеграмБоту.НайтиПоНаименованию("1");
			Сообщение = Спр.ПолучитьОбъект();
			Сообщение.ТекстСообщения = СтрШаблон("Заказ от %1 для  %2 зарегистрирован", Объект.Дата, Объект.Специалист);
			Сообщение.Записать();
		КонецЕсли;
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	СпециалистПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	ДатаПроведенияРаботПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
	Процедура Подключаемый_ВыполнитьКоманду(Команда)
		ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
	КонецПроцедуры

&НаКлиенте
	Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
		ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
	КонецПроцедуры

&НаСервере
	Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
		ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
	КонецПроцедуры

&НаКлиенте
	Процедура Подключаемый_ОбновитьКоманды() 
		ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	КонецПроцедуры

&НаСервере
Процедура СпециалистПриИзмененииНаСервере()
	Спр = Справочники.ВКМ_УведомленияТелеграмБоту.НайтиПоНаименованию("1");
	Сообщение = Спр.ПолучитьОбъект();
	Сообщение.ТекстСообщения = СтрШаблон("Заказ от %1 для  %2 изменен специалист", Объект.Дата, Объект.Специалист);
	Сообщение.Записать();
КонецПроцедуры

&НаСервере
Процедура ДатаПроведенияРаботПриИзмененииНаСервере()
	Спр = Справочники.ВКМ_УведомленияТелеграмБоту.НайтиПоНаименованию("1");
	Сообщение = Спр.ПолучитьОбъект();
	Сообщение.ТекстСообщения = СтрШаблон("Заказ от %1 для  %2 изменена дата", Объект.Дата, Объект.Специалист);
	Сообщение.Записать();
КонецПроцедуры

#КонецОбласти
