

#Область ПрограммныйИнтерфейс

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ДоговорВидДоговора,
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачала КАК ДоговорВКМ_ДатаНачала,
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончания КАК ДоговорВКМ_ДатаОкончания,
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_АбонентскаяПлата КАК ДоговорВКМ_АбонентскаяПлата,
			|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ОплатаЗаЧас КАК ДоговорВКМ_ОплатаЗаЧас,
			|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
			|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
			|	ВКМ_УсловияОплатыСотрудников.Пользователи КАК Пользователи,
			|	ВКМ_УсловияОплатыСотрудников.ПроцентДоплаты КАК ПроцентДоплаты,
			|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
			|ПОМЕСТИТЬ вт
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
			|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудников.Пользователи
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиентаВыполнениеРабот.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
			|	ВКМ_ОбслуживаниеКлиентаВыполнениеРабот.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
			|	вт.ДоговорВидДоговора КАК ДоговорВидДоговора,
			|	вт.ДоговорВКМ_ДатаНачала КАК ДоговорВКМ_ДатаНачала,
			|	вт.ДоговорВКМ_ДатаОкончания КАК ДоговорВКМ_ДатаОкончания,
			|	вт.ДоговорВКМ_АбонентскаяПлата КАК ДоговорВКМ_АбонентскаяПлата,
			|	вт.ДоговорВКМ_ОплатаЗаЧас КАК ДоговорВКМ_ОплатаЗаЧас,
			|	вт.Клиент КАК Клиент,
			|	вт.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
			|	вт.Специалист КАК Специалист,
			|	вт.ПроцентДоплаты КАК ПроцентДоплаты
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполнениеРабот КАК ВКМ_ОбслуживаниеКлиентаВыполнениеРабот,
			|	вт КАК вт
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиентаВыполнениеРабот.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроцентДоплаты) Тогда
			Сообщить("Не заполнен процент доплаты у специалиста, проведение отменено");
			Возврат;
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.ДоговорВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Клиент") Тогда
			Сообщить("Договор не того типа");
			Возврат;
		КонецЕсли;
		Если ВыборкаДетальныеЗаписи.ДоговорВКМ_ДатаНачала >= ВыборкаДетальныеЗаписи.ДатаПроведенияРабот ИЛИ ВыборкаДетальныеЗаписи.ДатаПроведенияРабот  >= ВыборкаДетальныеЗаписи.ДоговорВКМ_ДатаОкончания Тогда
			Сообщить("Договор не той даты");
			Возврат;
		КонецЕсли;
		
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот;
		Движение.Клиент = ВыборкаДетальныеЗаписи.Клиент;
		Движение.Договор = Ссылка;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ДоговорВКМ_ОплатаЗаЧас;
	
		Движение1 = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение1.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение1.Период = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот;
		Движение1.Сотрудник = ВыборкаДетальныеЗаписи.Специалист;
		Движение1.ЧасовКОплате = ВыборкаДетальныеЗаписи.ФактическиПотраченоЧасов;
		Движение1.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ДоговорВКМ_ОплатаЗаЧас *
		ВыборкаДетальныеЗаписи.ПроцентДоплаты / 100;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


