
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции


//ВКМ НАЧАЛО---------------------------------------------------------------------------------------------------------------
//1
//Определяет настройки объекта для подсистемы Печать.
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт    //1
    НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры


Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт        //2
     
    // Акт
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "Акт";
    КомандаПечати.Представление = НСтр("ru = 'Акт реализации услуг'");
    КомандаПечати.Порядок = 5;
    
КонецПроцедуры


Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт        //4
    
    ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Акт");
    Если ПечатнаяФорма <> Неопределено Тогда
        ПечатнаяФорма.ТабличныйДокумент = ПечатьАкта(МассивОбъектов, ОбъектыПечати);
        ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт реализации услуг'");
        ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ВКМ_ПФ_MXL_Акт";
    КонецЕсли;
     
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)    //5
    
    //формир таб документа
    ТабличныйДокумент = Новый ТабличныйДокумент;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Акт";    
    //@skip-check undefined-variable
    Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ВКМ_ПФ_MXL_Акт");
    
    //сбор данных
    ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
 
    //Шапка    
    ПервыйДокумент = Истина;
 
    Пока ДанныеДокументов.Следующий() Цикл
        
        Если Не ПервыйДокумент Тогда
            // Все документы нужно выводить на разных страницах.
            ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        
        ПервыйДокумент = Ложь;
        
        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
        
        ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
        
        //ВывестиРеквизитыСторон(ДанныеДокументов, ТабличныйДокумент, Макет);        
 
        
        ВывестиУслуги(ДанныеДокументов, ТабличныйДокумент, Макет);        
 
        ВывестиИтого(ДанныеДокументов, ТабличныйДокумент, Макет);        
 
        //@skip-check undefined-variable
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
        НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);        
         
    КонецЦикла;    
    
    Возврат ТабличныйДокумент;
    
КонецФункции


Функция ПолучитьДанныеДокументов(МассивОбъектов)    //6
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    РеализацияТоваровУслуг.Ссылка КАК Ссылка,
                   |    РеализацияТоваровУслуг.Номер КАК Номер,
                   |    РеализацияТоваровУслуг.Дата КАК Дата,
                   |    РеализацияТоваровУслуг.Проведен КАК Проведен,
                   |    РеализацияТоваровУслуг.Организация КАК Организация,
                   |    РеализацияТоваровУслуг.Контрагент КАК Контрагент,
                   |    РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
                   |    РеализацияТоваровУслуг.Основание КАК Основание,
                   |    РеализацияТоваровУслуг.Ответственный КАК Ответственный,
                   |    РеализацияТоваровУслуг.Комментарий КАК Комментарий,
                   |    РеализацияТоваровУслуг.Договор КАК Договор,
                   |    РеализацияТоваровУслуг.Услуги.(
                   |        Ссылка КАК Ссылка,
                   |        НомерСтроки КАК НомерСтроки,
                   |        Номенклатура КАК Номенклатура,
                   |        Количество КАК Количество,
                   |        Цена КАК Цена,
                   |        Сумма КАК Сумма
                   |    ) КАК Услуги
                   |ИЗ
                   |    Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
                   |ГДЕ
                   |    РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)";
    
    Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    
    Возврат Запрос.Выполнить().Выбрать();
    
КонецФункции


   
Процедура ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
    
    ОбластьЗаголовокДокумента = Макет.ПолучитьОбласть("Заголовок");
    
    ДанныеПечати = Новый Структура;
    //ДанныеПечати.Вставить("Дата", ДанныеДокументов.Дата);
    
    ШаблонЗаголовка = "Акт реализации услуг №%1 от %2 г.";
    ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
        ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
        Формат(ДанныеДокументов.Дата, "ДФ=dd.MM.yyyy; ДЛФ=DD"));
    ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
    ДанныеПечати.Вставить("Организация", ДанныеДокументов.Организация);
    ДанныеПечати.Вставить("Контрагент", ДанныеДокументов.Контрагент);
    
    ОбластьЗаголовокДокумента.Параметры.Заполнить(ДанныеПечати);
    ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
    
КонецПроцедуры    
 
Процедура ВывестиУслуги(ДанныеДокументов, ТабличныйДокумент, Макет)
    
    ОбластьСтрокаШапки = Макет.ПолучитьОбласть("СтрокаШапки");
    ОбластьСтрокаУслуги = Макет.ПолучитьОбласть("СтрокаУслуги");
 
    ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();
    
    ОбластьСтрокаШапки.Параметры.Заполнить(ВыборкаУслуги);
    Пока ВыборкаУслуги.Следующий() Цикл
        ОбластьСтрокаУслуги.Параметры.Заполнить(ВыборкаУслуги);
        ТабличныйДокумент.Вывести(ОбластьСтрокаУслуги);
    КонецЦикла;
    
КонецПроцедуры
  
Процедура ВывестиИтого(ДанныеДокументов, ТабличныйДокумент, Макет)
 
    ДанныеПечати = Новый Структура;
    ОбластьИтого = Макет.ПолучитьОбласть("Итого");
 
    ДанныеПечати.Вставить("Сумма", ДанныеДокументов.СуммаДокумента);
    ФормСтрока = "Л = ru_RU; ДП = Истина";
    ПарПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
    ИтогоПрописью = ЧислоПрописью(ДанныеДокументов.СуммаДокумента, ФормСтрока, ПарПредмета);
    ДанныеПечати.Вставить("СуммаПрописью", ИтогоПрописью);
    
    
    ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
    ТабличныйДокумент.Вывести(ОбластьИтого);
    
КонецПроцедуры
//ВКМ_ОКОНЧАНИЕ---------------------------------------------------------------------------------------------------------------
//1
//Определяет настройки объекта для подсистемы Печать.

#КонецОбласти	
#КонецЕсли