
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Строка Из СписокСотрудников Цикл
		Если ТипЗнч(Строка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Категория = Строка.Категория;
			Движение.Результат = Строка.СуммаПремии;

			Движение1 = Движения.ВКМ_Удержания.Добавить();
			Движение1.ПериодРегистрации = Дата;
			Движение1.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение1.Сотрудник = Строка.Сотрудник;
			Движение1.Категория = Строка.Категория;
			Движение1.Результат = 0.13 * Движение.Результат;
			
			Движение2 = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	
			Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение2.Период = Дата;
			Движение2.Сотрудник = Строка.Сотрудник;
			Движение2.Сумма = Движение.Результат - Движение1.Результат;

		Конецесли;
	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры


#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
