
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура СформироватьАктыТекущие(ДанныеЗаполнения) Экспорт

	ЭтотОбъект.СписокДоговоров.Очистить();
	
	 Запрос = Новый Запрос;
	 Запрос.Текст =
	 	"ВЫБРАТЬ
	 	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	 	|	ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата,
	 	|	ДоговорыКонтрагентов.ВКМ_ОплатаЗаЧас КАК ВКМ_ОплатаЗаЧас,
	 	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	 	|	ДоговорыКонтрагентов.Организация КАК Организация,
	 	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	 	|ПОМЕСТИТЬ ВрТаб
	 	|ИЗ
	 	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	 	|ГДЕ
	 	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	 	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	 	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	 	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот
	 	|ПОМЕСТИТЬ ВрТаб2
	 	|ИЗ
	 	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	 	|		ПО ВКМ_ОбслуживаниеКлиента.Договор <> РеализацияТоваровУслуг.Договор
	 	|ГДЕ
	 	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот >= &НАЧАЛОДата
	 	|	И ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот <= &КОНЕЦДата
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВрТаб.Владелец КАК Владелец,
	 	|	ВрТаб.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата,
	 	|	ВрТаб.ВКМ_ОплатаЗаЧас КАК ВКМ_ОплатаЗаЧас,
	 	|	ВрТаб.Наименование КАК Наименование,
	 	|	ВрТаб.Организация КАК Организация,
	 	|	ВрТаб.Ссылка КАК Ссылка,
	 	|	ВрТаб2.Клиент КАК Клиент,
	 	|	ВрТаб2.Договор КАК Договор,
	 	|	ВрТаб2.Специалист КАК Специалист,
	 	|	ВрТаб2.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	 	|	ВКМ_ВыполненныеКлиентуРаботыОстатки.Договор КАК Договор1,
	 	|	ВКМ_ВыполненныеКлиентуРаботыОстатки.СуммаКОплатеОстаток КАК СуммаКОплате
	 	|ИЗ
	 	|	ВрТаб КАК ВрТаб
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ ВрТаб2 КАК ВрТаб2
	 	|		ПО ВрТаб.Ссылка = ВрТаб2.Договор
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Остатки(&Период, ) КАК ВКМ_ВыполненныеКлиентуРаботыОстатки
	 	|		ПО ВрТаб.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОстатки.Договор";
	 
	 Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Клиент);
	 Запрос.УстановитьПараметр("Период", ДанныеЗаполнения.Период);
	 Запрос.УстановитьПараметр("НАЧАЛОДата", НачалоМесяца(ДанныеЗаполнения.Период));
	 Запрос.УстановитьПараметр("КОНЕЦДата", КонецМесяца(ДанныеЗаполнения.Период));
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	 	
	 	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	 	НовыйДокумент.Дата = ДанныеЗаполнения.Период;
	 	НовыйДокумент.Организация = ВыборкаДетальныеЗаписи.Клиент;
	 	НовыйДокумент.Договор = ВыборкаДетальныеЗаписи.Договор;
	 	НовыйДокумент.Контрагент = ВыборкаДетальныеЗаписи.Организация;
	 	 	
		
		Если ВыборкаДетальныеЗаписи.ВКМ_АбонентскаяПлата <> 0 Тогда
			НоваяСтрока = НовыйДокумент.Услуги.Добавить();
			НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.ВКМ_АбонентскаяПлата;
			
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СуммаКОплате <> 0 Тогда
			НоваяСтрока = НовыйДокумент.Услуги.Добавить();
			НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаКОплате;
		КонецЕсли;
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		НоваяСтрочка = СписокДоговоров.Добавить();
		НоваяСтрочка.Договор = ВыборкаДетальныеЗаписи.Договор;
		НоваяСтрочка.Реализация = НовыйДокумент.Договор;
		//ЗаполнитьЗначенияСвойств(НоваяСтрочка, ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти



#КонецЕсли
