
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура СформироватьАктыТекущие(Период) Экспорт

	 Запрос = Новый Запрос;
	 Запрос.Текст =
	 	"ВЫБРАТЬ
	 	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	 	|	ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата,
	 	|	ДоговорыКонтрагентов.ВКМ_ОплатаЗаЧас КАК ВКМ_ОплатаЗаЧас,
	 	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	 	|	ДоговорыКонтрагентов.Организация КАК Организация,
	 	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	 	|ПОМЕСТИТЬ ВрТаб
	 	|ИЗ
	 	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	 	|ГДЕ
	 	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	 	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	 	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	 	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот
	 	|ПОМЕСТИТЬ ВрТаб2
	 	|ИЗ
	 	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	 	|		ПО ВКМ_ОбслуживаниеКлиента.Договор <> РеализацияТоваровУслуг.Договор
	 	|ГДЕ
	 	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот > НАЧАЛОПЕРИОДА(&Период, Месяц)
	 	|	И ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот < КОНЕЦПЕРИОДА(&Периода, Месяц)
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВрТаб.Владелец КАК Владелец,
	 	|	ВрТаб.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата,
	 	|	ВрТаб.ВКМ_ОплатаЗаЧас КАК ВКМ_ОплатаЗаЧас,
	 	|	ВрТаб.Наименование КАК Наименование,
	 	|	ВрТаб.Организация КАК Организация,
	 	|	ВрТаб.Ссылка КАК Ссылка,
	 	|	ВрТаб2.Клиент КАК Клиент,
	 	|	ВрТаб2.Договор КАК Договор,
	 	|	ВрТаб2.Специалист КАК Специалист,
	 	|	ВрТаб2.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	 	|	ВКМ_ВыполненныеКлиентуРаботыОстатки.Договор КАК Договор1,
	 	|	ВКМ_ВыполненныеКлиентуРаботыОстатки.СуммаКОплатеОстаток КАК СуммаКОплате
	 	|ИЗ
	 	|	ВрТаб КАК ВрТаб
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ ВрТаб2 КАК ВрТаб2
	 	|		ПО ВрТаб.Ссылка = ВрТаб2.Договор
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Остатки(&Период,) КАК
	 	|			ВКМ_ВыполненныеКлиентуРаботыОстатки
	 	|		ПО ВрТаб.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОстатки.Договор";
	 
	 Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Клиент);
	  Запрос.УстановитьПараметр("Период", Период);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	 	
	 	Если ВыборкаДетальныеЗаписи.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Клиент Тогда
	 		Продолжить;
	 	КонецЕсли;
	 	
	 	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	 	новыйДокумент.Дата = ТекущаяДата();
	 	новыйДокумент.Организация = ВыборкаДетальныеЗаписи.Клиент;
	 	новыйДокумент.Договор = ВыборкаДетальныеЗаписи.Договор;
	 	НовыйДокумент.Контрагент = ВыборкаДетальныеЗаписи.Организация;
	 	 	
		
		Если ВыборкаДетальныеЗаписи.АбонентскаяПлата <> 0 Тогда
			НоваяСтрока = НовыйДокумент.Услуги.Добавить();
			НоваяСтрока.Номенклатура = Константы.ВКМ_АбонентскаяПлата.Получить();
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.АбонентскаяПлата;
			
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.СуммаКОплате <> 0 Тогда
			НоваяСтрока = НовыйДокумент.Услуги.Добавить();
			НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.СуммаКОплате;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
