
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

  Функция СформироватьАктыТекущие(ДанныеЗаполнения) Экспорт
    
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |    ДоговорыКонтрагентов.Наименование КАК Наименование,
        |    ДоговорыКонтрагентов.Ссылка КАК Ссылка,
        |    ДоговорыКонтрагентов.Организация КАК Организация,
        |    ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата
        |ПОМЕСТИТЬ ВТ1
        |ИЗ
        |    Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |ГДЕ
        |    ДоговорыКонтрагентов.ВКМ_ДатаНачала < &КОНЕЦДата
        |    И ДоговорыКонтрагентов.ВКМ_ДатаОкончания > &НАЧАЛОДата
        |    И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    РеализацияТоваровУслуг.Ссылка КАК Ссылка,
        |    РеализацияТоваровУслуг.Договор.Ссылка КАК ДоговорСсылка
        |ПОМЕСТИТЬ ВТ2
        |ИЗ
        |    Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |ГДЕ
        |    РеализацияТоваровУслуг.Дата >= &НАЧАЛОДата
        |    И РеализацияТоваровУслуг.Дата <= &КОНЕЦДата
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ВТ1.Наименование КАК Наименование,
        |    ЕСТЬNULL(ВТ2.Ссылка, 0) КАК ДокументРеализации,
        |    ВТ1.Ссылка КАК ДоговорКотрагента,
        |    ВТ1.Организация КАК Организация,
        |    ВТ1.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата
        |ПОМЕСТИТЬ ВТ3
        |ИЗ
        |    ВТ1 КАК ВТ1
        |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ2 КАК ВТ2
        |        ПО ВТ1.Ссылка = ВТ2.ДоговорСсылка.Ссылка
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ВКМ_ВыполненныеКлиентуРаботыОстатки.СуммаКОплатеОстаток КАК СуммаКОплатеОстаток,
        |    ВКМ_ОбслуживаниеКлиента.Договор КАК Договор
        |ПОМЕСТИТЬ ВТ4
        |ИЗ
        |    Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
        |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Остатки(&Период, ) КАК ВКМ_ВыполненныеКлиентуРаботыОстатки
        |        ПО ВКМ_ОбслуживаниеКлиента.Договор = ВКМ_ВыполненныеКлиентуРаботыОстатки.Договор
        |ГДЕ
        |    ВКМ_ОбслуживаниеКлиента.Дата <= &КОНЕЦДата
        |    И ВКМ_ОбслуживаниеКлиента.Дата >= &НАЧАЛОДата
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ЕСТЬNULL(ВТ4.СуммаКОплатеОстаток, 0) КАК СуммаКОплатеОстаток,
        |    ВТ3.Наименование КАК Наименование,
        |    ВТ3.ДокументРеализации КАК ДокументРеализации,
        |    ВТ3.ДоговорКотрагента КАК ДоговорКотрагента,
        |    ВТ3.Организация КАК Организация,
        |    ВТ3.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата,
        |    ВТ3.ДоговорКотрагента.Владелец КАК ДоговорКотрагентаВладелец
        |ИЗ
        |    ВТ3 КАК ВТ3
        |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ4 КАК ВТ4
        |        ПО ВТ3.ДоговорКотрагента = ВТ4.Договор";
        
        Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Клиент);
        Запрос.УстановитьПараметр("Период", ДанныеЗаполнения.Период);
        Запрос.УстановитьПараметр("НАЧАЛОДата", НачалоМесяца(ДанныеЗаполнения.Период));
        Запрос.УстановитьПараметр("КОНЕЦДата", КонецМесяца(ДанныеЗаполнения.Период));
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            
            Если ВыборкаДетальныеЗаписи.ДокументРеализации <> 0 Тогда
            НоваяСтрочка = СписокДоговоров.Добавить();
            НоваяСтрочка.Договор = ВыборкаДетальныеЗаписи.ДоговорКотрагента;
            НоваяСтрочка.Реализация = ВыборкаДетальныеЗаписи.ДокументРеализации;
            Продолжить;
            
            КонецЕсли;
            
            НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
            НовыйДокумент.Дата = ДанныеЗаполнения.Период;
            НовыйДокумент.Организация = ВыборкаДетальныеЗаписи.Организация;
            НовыйДокумент.Договор = ВыборкаДетальныеЗаписи.ДоговорКотрагента;
            НовыйДокумент.Контрагент = ВыборкаДетальныеЗаписи.ДоговорКотрагентаВладелец;          
            
            Если ВыборкаДетальныеЗаписи.ВКМ_АбонентскаяПлата <> 0 Тогда
                НоваяСтрока = НовыйДокумент.Услуги.Добавить();
                НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
                НоваяСтрока.Количество = 1;
                НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.ВКМ_АбонентскаяПлата;
                
            КонецЕсли;
            
            Если ВыборкаДетальныеЗаписи.СуммаКОплатеОстаток <> 0 Тогда
                НоваяСтрока = НовыйДокумент.Услуги.Добавить();
                НоваяСтрока.Номенклатура = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
                НоваяСтрока.Количество = 1;
                НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКОплатеОстаток;
            КонецЕсли;
            
            НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
            
            НоваяСтрочка = СписокДоговоров.Добавить();
            НоваяСтрочка.Договор = НовыйДокумент.Договор;
            НоваяСтрочка.Реализация = НовыйДокумент.Ссылка;
            //ЗаполнитьЗначенияСвойств(НоваяСтрочка, ВыборкаДетальныеЗаписи);
        КонецЦикла;
        Возврат СписокДоговоров;
    КонецФункции

#КонецОбласти



#КонецЕсли
