#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
      
    
    //Движение по регистрам расчета BKM_ДополнительныеНачисления и BKM_Удержания
    
    СписокСотрудниковТЧ = СписокСотрудников.Выгрузить();
    СписокСотрудниковТЧ.Свернуть("Сотрудник", "СуммаПремии");
    
    Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
    Движения.ВКМ_Удержания.Записывать = Истина;
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
        
    //@skip-check module-unused-local-variable
    Для Каждого Строка из СписокСотрудниковТЧ Цикл
 
    // регистр ВКМ_ДополнительныеНачисления
        Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        Движение.Сторно = Ложь;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияФиксированная;
        Движение.ПериодРегистрации = Дата;
        Движение.Сотрудник = Строка.Сотрудник;
        Движение.Результат = Строка.СуммаПремии;
    
    // регистр ВКМ_Удержания

        Движение1 = Движения.ВКМ_Удержания.Добавить();
        Движение1.Сторно = Ложь;
        Движение1.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        Движение1.ПериодРегистрации = Дата;
        Движение1.ПериодДействияНачало = НачалоМесяца(Дата);
        Движение1.ПериодДействияКонец = КонецМесяца(Дата);
        Движение1.Сотрудник = Строка.Сотрудник;
        Движение1.Результат = Строка.СуммаПремии * 13 /100;
        
      // регистр ВКМ_ВзаиморасчетыССотрудниками
        Движение2 = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        Движение2.Период = Дата;
        Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение2.Сотрудник = Строка.Сотрудник;
        Движение2.Сумма = Движение.Результат - Движение1.Результат;
     
    КонецЦикла;
        
    Движения.ВКМ_ДополнительныеНачисления.Записать();;
    Движения.ВКМ_Удержания.Записать(); 
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
    
КонецПроцедуры 
  
#КонецОбласти
#КонецЕсли