#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
      
    
    //Движение по регистрам расчета BKM_ДополнительныеНачисления и BKM_Удержания
    
    СписокСотрудниковТЧ = СписокСотрудников.Выгрузить();
    СписокСотрудниковТЧ.Свернуть("Сотрудник", "СуммаПремии");
    
    Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
    Движения.ВКМ_Удержания.Записывать = Истина;
    
    //@skip-check module-unused-local-variable
    Для Каждого Строка из СписокСотрудниковТЧ Цикл
 
    // регистр ВКМ_ДополнительныеНачисления
        Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
        Движение.Сторно = Ложь;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияФиксированная;
        Движение.ПериодРегистрации = Дата;
        Движение.Сотрудник = Строка.Сотрудник;
        Движение.Результат = Строка.СуммаПремии;
    
    // регистр ВКМ_Удержания
        Движения.ВКМ_Удержания.Записывать = Истина;
        Движение = Движения.ВКМ_Удержания.Добавить();
        Движение.Сторно = Ложь;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        Движение.ПериодРегистрации = Дата;
        Движение.ПериодДействияНачало = НачалоМесяца(Дата);
        Движение.ПериодДействияКонец = КонецМесяца(Дата);
        Движение.Сотрудник = Строка.Сотрудник;
        Движение.Результат = Строка.СуммаПремии * 13 /100;
    КонецЦикла;
        
    Движения.ВКМ_ДополнительныеНачисления.Записать();;
    Движения.ВКМ_Удержания.Записать(); 
    
    
    // Движение по Регистру накопления BKM_ВзаиморасчетыССотрудниками
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
    |    ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
    |    ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0) КАК Сумма
    |ПОМЕСТИТЬ ВТ_Результаты
    |ИЗ
    |    РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |    ВКМ_Удержания.Сотрудник,
    |    ЕСТЬNULL(ВКМ_Удержания.Результат, 0)
    |ИЗ
    |    РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
    |ГДЕ
    |    ВКМ_Удержания.Регистратор = &Ссылка
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |    ВТ_Результаты.Сотрудник КАК Сотрудник,
    |    СУММА(ВТ_Результаты.Сумма) КАК Сумма
    |ИЗ
    |    ВТ_Результаты КАК ВТ_Результаты
    |СГРУППИРОВАТЬ ПО
    |    ВТ_Результаты.Сотрудник";
    Запрос.УстановитьПараметр("Ссылка", Ссылка);    
    
    Выборка = Запрос.Выполнить().Выбрать();
        
    
    
    // регистр ВКМ_ВзаиморасчетыССотрудниками
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
    Пока Выборка.Следующий() Цикл
        Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        Движение.Период = Дата;
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Сотрудник = Выборка.Сотрудник;
        Движение.Сумма = Выборка.Сумма;
    КонецЦикла;
 
    
КонецПроцедуры 
  
#КонецОбласти
#КонецЕсли