
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ, Режим)
		 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
		|		ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ) + 1) КАК ОбщаяПродолжительностьОтпуска,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник";
	

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	// регистр BKM_СведенияОбОтпусках 
	Движения.ВКМ_СведенияОбОтпусках.Записывать= Истина;
	Движения.ВКМ_Отпуска.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл

		Движение = Движения.ВКМ_СведенияОбОтпусках.Добавить();
		Движение.Период = Год;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Год = Год;
		Движение.ПлановаяПродолжительностьОтпуска = Выборка.ОбщаяПродолжительностьОтпуска;
		
		ДвижениеРН = Движения.ВКМ_Отпуска.Добавить();
		ДвижениеРН.Период = Год;
		ДвижениеРН.Сотрудник = Выборка.Сотрудник;
		ДвижениеРН.Год = Год;
		ДвижениеРН.ВсегоДней = Выборка.ОбщаяПродолжительностьОтпуска;
	КонецЦикла;

	
КонецПроцедуры


#КонецОбласти


#КонецЕсли
