
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ОбработчикиСобытий
 
Процедура ОбработкаПроведения(Отказ, Режим)
    
    Если ОсновныеНачисления.Количество() = 0 И ДополнительныеНачисления.Количество() = 0 Тогда
        Сообщение = Новый СообщениеПользователю();
        Сообщение.Текст = "Табличные части документа пустые, документ не может быть проведен.";
        Сообщение.Сообщить();
        Возврат
    КонецЕсли;
    
    СформироватьДвиженияПоОкладу();
    СформироватьДвиженияПоОтпуску();
    СформироватьНДФЛ();    
    РассчитатьОклад();
    РассчитатьОтпуск(); 
    РассчитатьДоплатуСпециалистам();
    РасчитатьНДФЛ();    
 
КонецПроцедуры  
#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции 
Процедура СформироватьДвиженияПоОкладу();
    
    Для Каждого Строка Из ОсновныеНачисления Цикл
        Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
            Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
            Движение.ПериодРегистрации = Дата;
            Движение.ВидРасчета = Строка.ВидРасчета;
            Движение.ПериодДействияНачало = Строка.ДатаНачала;
            Движение.ПериодДействияКонец = Строка.ДатаОкончания;
            Движение.Сотрудник = Строка.Сотрудник;
            Движение.Категория = Строка.Категория;
            Движение.ГрафикРаботы = Строка.ГрафикРаботы;
           
        Конецесли;
        
    КонецЦикла;
 
    Движения.ВКМ_ОсновныеНачисления.Записать();

КонецПроцедуры

Процедура СформироватьДвиженияПоОтпуску();
    
    Для Каждого Строка Из ОсновныеНачисления Цикл
        Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
            Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
            Движение.ПериодРегистрации = Дата;
            Движение.ВидРасчета = Строка.ВидРасчета;
            Движение.ПериодДействияНачало = Строка.ДатаНачала;
            Движение.ПериодДействияКонец = Строка.ДатаОкончания;
            Движение.Сотрудник = Строка.Сотрудник;
            Движение.Категория = Строка.Категория;
            Движение.ГрафикРаботы = Строка.ГрафикРаботы;
            Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Строка.ДатаНачала, -12));
            Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Строка.ДатаНачала, -1));    
 
        Конецесли;
        
    КонецЦикла;
 
    Движения.ВКМ_ОсновныеНачисления.Записать();

    //Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
КонецПроцедуры

Процедура СформироватьНДФЛ()
    
    СписокСотрудников = ОсновныеНачисления.Выгрузить(,"Сотрудник"); 
    ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДополнительныеНачисления,СписокСотрудников); 
    СписокСотрудников.Свернуть("Сотрудник"); 
    
    // регистр BKM_Удержания 
    Движения.ВКМ_Удержания.Записывать = Истина;
    
    Для Каждого Сотрудник Из СписокСотрудников  Цикл
        
        Движение = Движения.ВКМ_Удержания.Добавить(); 
        Движение.Сторно = Ложь;
        Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
        Движение.ПериодРегистрации = Дата;        
        Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
        Движение.БазовыйПериодКонец = КонецМесяца(Дата);
        Движение.Сотрудник = Сотрудник.Сотрудник;
        
    КонецЦикла;
    
    Движения.ВКМ_Удержания.Записать();    
    
КонецПроцедуры

Процедура РассчитатьОклад()
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
        |    ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
        |    ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План,
        |    ВКМ_УсловияОплатыСотрудников.Оклад КАК Оклад,
        |    ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
        |    ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
        |    ВКМ_ОсновныеНачисленияДанныеГрафика.Категория КАК Категория,
        |    ВКМ_ОсновныеНачисленияДанныеГрафика.Результат КАК Результат
        |ИЗ
        |    РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
        |            Регистратор = &Ссылка
        |                И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
        |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
        |        ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудников.Пользователи";
    
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
    
    РезультатЗапроса = Запрос.Выполнить();
     
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            
        Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
        Движение.Результат = ВыборкаДетальныеЗаписи.Оклад * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.План; 
        Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;
        Движение.Размер = ВыборкаДетальныеЗаписи.Оклад;
            
        Движение2 = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();    
        Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение2.Период = Дата;
        Движение2.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
        Движение2.Сумма = Движение.Результат;
 
    КонецЦикла;
    
    Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
 
        
КонецПроцедуры
 
Процедура РассчитатьОтпуск()
 
    Запрос = Новый Запрос;
    
    Запрос.Текст = 
            "ВЫБРАТЬ
            |	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
            |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК БазаОсн,
            |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК БазаДоп,
            |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК БазаОтработано,
            |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
            |	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
            |	ВКМ_ОсновныеНачисления.Регистратор КАК Регистратор,
            |	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
            |	РАЗНОСТЬДАТ(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияНачало,
            |		ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияКонец, ДЕНЬ) + 1 КАК Отпуск
            |ИЗ
            |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,,
            |			Регистратор = &Ссылка
            |		И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
            |		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки
            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,,
            |			Регистратор = &Ссылка
            |		И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
            |		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика() КАК ВКМ_ОсновныеНачисленияДанныеГрафика
            |		ПО ВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник
            |ГДЕ
            |	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
            |	И ВКМ_ОсновныеНачисления.ВидРасчета = &ВидРасчета";
            
    Запрос.УстановитьПараметр("Регистратор", Ссылка);
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
    
    Измерения = Новый Массив;
    Измерения.Добавить("Категория");
    Измерения.Добавить("Сотрудник");
    Запрос.УстановитьПараметр("Измерения", Измерения);
 
     
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    СтрокаРасходаОтпуска = 1000;
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        
        Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
        Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Отпуск;
        
        Если СтрокаРасходаОтпуска <> ВыборкаДетальныеЗаписи.НомерСтроки Тогда
            
            Движение3 = Движения.ВКМ_Отпуска.Добавить();
            Движение3.Период = Дата;
            Движение3.Год = Формат(Дата,"ДФ=гггг");
            Движение3.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
            Движение3.ИспользованоДней = ВыборкаДетальныеЗаписи.Отпуск; 
            Движение2 = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();  
            
            Если ВыборкаДетальныеЗаписи.БазаОтработано = 0 Тогда
                Движение.Результат = 0;
                Продолжить;
            КонецЕсли;
            
            Движение.Результат = (ВыборкаДетальныеЗаписи.БазаОсн + ВыборкаДетальныеЗаписи.БазаДоп) * 
            ВыборкаДетальныеЗаписи.Отпуск / ВыборкаДетальныеЗаписи.БазаОтработано;
            Движение.Размер = ВыборкаДетальныеЗаписи.БазаОсн + ВыборкаДетальныеЗаписи.БазаДоп; 
            
            Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
            Движение2.Период = Дата;
            Движение2.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
            Движение2.Сумма = Движение.Результат;
     
        КонецЕсли;
        
        СтрокаРасходаОтпуска = ВыборкаДетальныеЗаписи.НомерСтроки;

    КонецЦикла;
    
    Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
    Движения.ВКМ_Отпуска.Записать();    
КонецПроцедуры
  
Процедура РассчитатьДоплатуСпециалистам()
    
    ДополнительныеНачисления.Очистить();
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
        |	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.ЧасовКОплатеОборот, 0)) КАК Часы,
        |	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 0)) КАК Сумма
        |ИЗ
        |	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, Месяц,) КАК
        |		ВКМ_ВыполненныеСотрудникомРаботыОбороты
        |СГРУППИРОВАТЬ ПО
        |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник";
    
    Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
    Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
            Движение.ПериодРегистрации = Дата;
            Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ДоплатаСпециалистам;
            Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
            Движение.Категория = ПредопределенноеЗначение("Справочник.ВКМ_КатегорияПользователей.Специалист");
            Движение.Результат = ВыборкаДетальныеЗаписи.Сумма;
 
            Движение2 = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();    
            Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
            Движение2.Период = Дата;
            Движение2.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
            Движение2.Сумма = Движение.Результат;    
            
            НоваяСтрока = ДополнительныеНачисления.Добавить();
            НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
            НоваяСтрока.СуммаНачисления = Движение.Результат;
            НоваяСтрока.НачисленоЧасов = ВыборкаДетальныеЗаписи.Часы;
            НоваяСтрока.Категория = Справочники.ВКМ_КатегорияПользователей.Специалист;
    КонецЦикла;
    
    Движения.ВКМ_ДополнительныеНачисления.Записать();
  
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
 
КонецПроцедуры
 
Процедура РасчитатьНДФЛ()
    
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
      "ВЫБРАТЬ
      |    ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки, 0) КАК НомерСтроки,
      |    ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБазаОсновныеНачисления
      |ПОМЕСТИТЬ ВТ_ОсновныеНачисления
      |ИЗ
      |    РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(
      |            &Измерения,
      |            &Измерения,
      |            &Разрезы,
      |            Регистратор = &Ссылка
      |                И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
      |;
      |
      |////////////////////////////////////////////////////////////////////////////////
      |ВЫБРАТЬ
      |    ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки, 0) КАК НомерСтроки1,
      |    ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК Поле1
      |ПОМЕСТИТЬ ВТ_ДополнительныеНачисления
      |ИЗ
      |    РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(
      |            &Измерения,
      |            &Измерения,
      |            &Разрезы,
      |            Регистратор = &Ссылка
      |                И ВидРасчета = &НДФЛ) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
      |;
      |
      |////////////////////////////////////////////////////////////////////////////////
      |ВЫБРАТЬ
      |    ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
      |    ВКМ_Удержания.Сотрудник КАК Сотрудник,
      |    ВТ_ОсновныеНачисления.РезультатБазаОсновныеНачисления + ВТ_ДополнительныеНачисления.Поле1 КАК БазаНДФЛ,
      |    ВТ_ОсновныеНачисления.РезультатБазаОсновныеНачисления КАК РезультатБазаОсновныеНачисления,
      |    ВТ_ДополнительныеНачисления.Поле1 КАК Поле1
      |ИЗ
      |    РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
      |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеНачисления КАК ВТ_ОсновныеНачисления
      |        ПО ВКМ_Удержания.НомерСтроки = ВТ_ОсновныеНачисления.НомерСтроки
      |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДополнительныеНачисления КАК ВТ_ДополнительныеНачисления
      |        ПО ВКМ_Удержания.НомерСтроки = ВТ_ДополнительныеНачисления.НомерСтроки1
      |ГДЕ
      |    ВКМ_Удержания.Регистратор = &Ссылка
      |    И ВКМ_Удержания.ВидРасчета = &НДФЛ"; 
    
    
    Запрос.УстановитьПараметр("НДФЛ", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);   
    Запрос.УстановитьПараметр("Ссылка", Ссылка);
 
    Измерения = Новый Массив; 
    Измерения.Добавить("Сотрудник");                                 
    
    Разрезы = Новый Массив; 
    Разрезы.Добавить("Регистратор");
 
    Запрос.УстановитьПараметр("Разрезы", Разрезы);
    Запрос.УстановитьПараметр("Измерения", Измерения);
    
    
    Выборка = Запрос.Выполнить().Выбрать();
        
    Пока Выборка.Следующий() Цикл
		
        Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
        Движение.Результат = Цел(Выборка.БазаНДФЛ * 13 / 100);
		
		Если Движение.Результат = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение2 = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();    
        Движение2.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение2.Период = Дата;
		Движение2.Сотрудник = Выборка.Сотрудник;
        Движение2.Сумма = Движение.Результат;
    КонецЦикла;    	

    Движения.ВКМ_Удержания.Записать(,Истина);		
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
    
КонецПроцедуры
 
#КонецОбласти
 
#КонецЕсли