
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СформироватьДвиженияПоОкладу();
	СформироватьДвиженияПоОтпуску();
	
	РассчитатьОклад();
	РассчитатьОтпуск();

	РассчитатьДоплатуСпециалистам();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Процедура СформироватьДвиженияПоОкладу();
	
	Для Каждого Строка Из Начисления Цикл
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.ПериодДействияНачало = Строка.ДатаНачала;
			Движение.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Категория = Строка.Категория;
			Движение.ГрафикРаботы = Строка.ГрафикРаботы;
			
			Движение1 = Движения.ВКМ_Удержания.Добавить();
			Движение1.ПериодРегистрации = Дата;
			Движение1.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение1.ПериодДействияНачало = Строка.ДатаНачала;
			Движение1.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение1.Сотрудник = Строка.Сотрудник;
			Движение1.Категория = Строка.Категория;
				
		Конецесли;
		
	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	//Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
КонецПроцедуры

Процедура СформироватьДвиженияПоОтпуску();
	
	Для Каждого Строка Из Начисления Цикл
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.ПериодДействияНачало = Строка.ДатаНачала;
			Движение.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Категория = Строка.Категория;
			Движение.ГрафикРаботы = Строка.ГрафикРаботы;
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Строка.ДатаНачала, -12));
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Строка.ДатаНачала, -1));	

			Движение1 = Движения.ВКМ_Удержания.Добавить();
			Движение1.ПериодРегистрации = Дата;
			Движение1.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение1.ПериодДействияНачало = Строка.ДатаНачала;
			Движение1.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение1.Сотрудник = Строка.Сотрудник;
			Движение1.Категория = Строка.Категория;
			//
			//Движение3 = Движения.ВКМ_Отпуска.Добавить();
			//Движение3.Период = Дата;
			//Движение3.Год = Дата;
			//Движение3.Сотрудник = Строка.Сотрудник;

		Конецесли;
		
	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	//Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
КонецПроцедуры

Процедура РассчитатьОклад()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План,
		|	ВКМ_УсловияОплатыСотрудников.Оклад КАК Оклад,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Категория КАК Категория,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.Результат КАК Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
		|			Регистратор = &Ссылка
		|				И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
		|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудников.Пользователи";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	
	РезультатЗапроса = Запрос.Выполнить();
	 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Движение.Результат = ВыборкаДетальныеЗаписи.Оклад * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.План; 
		Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;
		Движение.Размер = ВыборкаДетальныеЗаписи.Оклад;
		
		Движение1 = Движения.ВКМ_Удержания[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Движение1.Размер = Движение.Результат;
		Движение1.Результат = 0.13 * Движение1.Размер; 
			
		Движение2 = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();	
		Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение2.Период = Дата;
		Движение2.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение2.Сумма = Движение.Результат - Движение1.Результат;

	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

		
КонецПроцедуры

Процедура РассчитатьОтпуск()

	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК БазаОсн,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК БазаДоп,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК БазаОтработано,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
		|				&Измерения,
		|				&Измерения,
		|				,
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
		|				&Измерения,
		|				&Измерения,
		|				,
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &ВидРасчета) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Категория");
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);

	 
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;
			
		Если ВыборкаДетальныеЗаписи.БазаОтработано = 0 Тогда
			Движение.Результат = 0;
			Продолжить;
		КонецЕсли;
			
		Движение.Результат = (ВыборкаДетальныеЗаписи.БазаОсн + ВыборкаДетальныеЗаписи.БазаДоп) * 
		ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.БазаОтработано;
		Движение.Размер = ВыборкаДетальныеЗаписи.БазаОсн + ВыборкаДетальныеЗаписи.БазаДоп; 
		
		Движение1 = Движения.ВКМ_Удержания[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Движение1.Размер = Движение.Результат;
		Движение1.Результат = 0.13 * Движение1.Размер; 
		
		Движение2 = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();	
		Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение2.Период = Дата;
		Движение2.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение2.Сумма = Движение.Результат - Движение1.Результат;
		
					
		Движение3 = Движения.ВКМ_Отпуска.Добавить();
		Движение3.Период = Дата;
		Движение3.Год = Дата;
		Движение3.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		//Движение3 = Движения.ВКМ_Отпуска[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Движение3.ИспользованоДней = ВыборкаДетальныеЗаписи.Факт;	


	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	Движения.ВКМ_Отпуска.Записать();	
КонецПроцедуры

Процедура РассчитатьДоплатуСпециалистам();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеСотрудникомРаботыОстатки.СуммаКОплатеОстаток КАК СуммаКОплатеОстаток,
		|	ВКМ_ВыполненныеСотрудникомРаботыОстатки.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки(&Период, ) КАК ВКМ_ВыполненныеСотрудникомРаботыОстатки";
	
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ДоплатаСпециалистам;
			Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Движение.Категория = ПредопределенноеЗначение("Справочник.ВКМ_КатегорияПользователей.Специалист");
			Движение.Результат = ВыборкаДетальныеЗаписи.СуммаКОплатеОстаток;
			
			Движение1 = Движения.ВКМ_Удержания.Добавить();
			Движение1.ПериодРегистрации = Дата;
			Движение1.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение1.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Движение1.Результат = 0.13 * ВыборкаДетальныеЗаписи.СуммаКОплатеОстаток;

			Движение2 = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();	
			Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение2.Период = Дата;
			Движение2.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Движение2.Сумма = Движение.Результат - Движение1.Результат;	
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры


// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
