
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Клиент") Тогда
		Элементы.ВКМ_Оплата.Видимость = Истина;
		Элементы.ВКМ_Период.Видимость = Истина;
	Иначе
		Элементы.ВКМ_Оплата.Видимость = Ложь;
		Элементы.ВКМ_Период.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Клиент") Тогда
		Элементы.ВКМ_Оплата.Видимость = Истина;
		Элементы.ВКМ_Период.Видимость = Истина;
	Иначе
		Элементы.ВКМ_Оплата.Видимость = Ложь;
		Элементы.ВКМ_Период.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
