

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Клиент") Тогда
		Элементы.ВКМ_ГруппаОплата.Видимость = Истина;
		Элементы.ВКМ_ГруппаДата.Видимость = Истина;
	Иначе
		Элементы.ВКМ_ГруппаОплата.Видимость = Ложь;
		Элементы.ВКМ_ГруппаДата.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВКМ_ОбработкаАктивизации(АктивныйОбъект, Источник)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Клиент") Тогда
		Элементы.ВКМ_ГруппаОплата.Видимость = Истина;
		Элементы.ВКМ_ГруппаДата.Видимость = Истина;
	Иначе
		Элементы.ВКМ_ГруппаОплата.Видимость = Ложь;
		Элементы.ВКМ_ГруппаДата.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВКМ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		ВКМ_ГруппаДата = Элементы.Добавить("ВКМ_ГруппаДата", Тип("ГруппаФормы"), ЭтотОбъект);		
		//ВКМ_ГруппаДата = Элементы.Добавить("ВКМ_ГруппаДата", Тип("ГруппаФормы"), ЭтаФорма);
		ВКМ_ГруппаДата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ВКМ_ГруппаДата.Отображение = ОтображениеОбычнойГруппы.Нет;
		ВКМ_ГруппаДата.ОтображатьЗаголовок = Ложь;
		ВКМ_ГруппаДата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент =  Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"), ВКМ_ГруппаДата);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		
		НовыйЭлемент =  Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"), ВКМ_ГруппаДата);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";	ВКМ_ГруппаОплата = Элементы.Добавить("ВКМ_ГруппаОплата", Тип("ГруппаФормы"), ЭтаФорма);
		
		ВКМ_ГруппаОплата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ВКМ_ГруппаОплата.Отображение = ОтображениеОбычнойГруппы.Нет;
		ВКМ_ГруппаОплата.ОтображатьЗаголовок = Ложь;
		ВКМ_ГруппаОплата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент =  Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"), ВКМ_ГруппаОплата);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		
		НовыйЭлемент =  Элементы.Добавить("ОплатаЗаЧас", Тип("ПолеФормы"), ВКМ_ГруппаОплата);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ОплатаЗаЧас";

КонецПроцедуры
#КонецОбласти
