#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Период = ТекущаяДата();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СформироватьАкты(Команда)
	СформироватьАктыНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьАктыНаСервере()
	
	Объект.СписокДоговоров.Очистить();
 	ДокОбъект = РеквизитФормыВЗначение("Объект");
	СписокДоговоров1 = ДокОбъект.СформироватьАктыТекущие(ДокОбъект);
	Для Каждого Строка Из СписокДоговоров1 Цикл
		НоваяСтрока = Объект.СписокДоговоров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

